# https://github.com/Homebrew/homebrew-bundle

cask_args appdir: "/Applications"

# Why do I need to tap?
tap "getantibody/tap"
tap "homebrew/cask-fonts"

# Install GnuPG to enable PGP-signing commits.
brew "gnupg"

# Install more recent versions of some macOS tools.
brew "coreutils"
brew "zsh"
brew "bash"
brew "gnu-sed"
brew "nvim"
brew "vim"
brew "grep"
brew "ripgrep"
brew "openssh"
brew "tmux"
brew "php"
brew "git"
brew "git-lfs"
brew "ruby"
brew "python"

# Install other useful binaries.
brew "getantibody/tap/antibody"
brew "ack"
brew "gs"
brew "imagemagick"
brew "p7zip"
brew "pv"
brew "rlwrap"
brew "tree"
brew "fzf"
brew "tldr"
brew "vbindiff"
brew "zopfli"
brew "jump"
brew "jq"
brew "bat"
brew "exa"

cask "alfred"
cask "font-source-code-pro"
cask "iterm2"
cask "quicklook-json"
cask "qlstephen"
cask "rectangle"
cask "visual-studio-code"
